bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATmega64L-8AU" tempmin="-40" tempmax="85" speedmax="8000000" pinout="TQFPQFN64" package="TQFP64" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega64L-8MU" tempmin="-40" tempmax="85" speedmax="8000000" pinout="TQFPQFN64" package="QFN64" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega64-16AU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN64" package="TQFP64" vccmin="4.5" vccmax="5.5"/>
        <variant ordercode="ATmega64-16MU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN64" package="QFN64" vccmin="4.5" vccmax="5.5"/>
        <variant ordercode="ATmega64L-8AN" tempmin="-40" tempmax="105" speedmax="8000000" pinout="TQFPQFN64" package="TQFP64" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega64L-8MN" tempmin="-40" tempmax="105" speedmax="8000000" pinout="TQFPQFN64" package="QFN64" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega64-16AN" tempmin="-40" tempmax="105" speedmax="16000000" pinout="TQFPQFN64" package="TQFP64" vccmin="4.5" vccmax="5.5"/>
        <variant ordercode="ATmega64-16MN" tempmin="-40" tempmax="105" speedmax="16000000" pinout="TQFPQFN64" package="QFN64" vccmin="4.5" vccmax="5.5"/>
    </variants>
    <device name="ATmega64" family="AVR8" architecture="AVR8" avr-family="megaAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x10000">
                <memory-segment start="0x0000" size="0x10000" type="flash" rw="RW" exec="1" name="FLASH" pagesize="0x100"/>
                <memory-segment start="0xfc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1" pagesize="0x100"/>
                <memory-segment start="0xf800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2" pagesize="0x100"/>
                <memory-segment start="0xf000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3" pagesize="0x100"/>
                <memory-segment start="0xe000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4" pagesize="0x100"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x10000">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0100" size="0x1000" type="ram" external="false"/>
                <memory-segment name="XRAM" start="0x1100" size="0xef00" type="ram" external="true"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0800">
                <memory-segment start="0x0000" size="0x0800" type="eeprom" rw="RW" exec="0" name="EEPROM" pagesize="0x08"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="4">
                <memory-segment start="0" size="4" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data" caption="Analog Comparator"/>
                    <signals>
                        <signal group="AIN" index="1" function="default" pad="PE3"/>
                        <signal group="AIN" index="0" function="default" pad="PE2"/>
                    </signals>
                </instance>
            </module>
            <module name="ADC">
                <instance name="ADC" caption="Analog-to-Digital Converter">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data" caption="Analog-to-Digital Converter"/>
                    <signals>
                        <signal group="ADC" index="7" function="default" pad="PF7"/>
                        <signal group="ADC" index="6" function="default" pad="PF6"/>
                        <signal group="ADC" index="5" function="default" pad="PF5"/>
                        <signal group="ADC" index="4" function="default" pad="PF4"/>
                        <signal group="ADC" index="3" function="default" pad="PF3"/>
                        <signal group="ADC" index="2" function="default" pad="PF2"/>
                        <signal group="ADC" index="1" function="default" pad="PF1"/>
                        <signal group="ADC" index="0" function="default" pad="PF0"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data" caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal group="MISO" function="default" pad="PB3"/>
                        <signal group="MOSI" function="default" pad="PB2"/>
                        <signal group="SCK" function="default" pad="PB1"/>
                        <signal group="SS" function="default" pad="PB0"/>
                    </signals>
                </instance>
            </module>
            <module name="TWI">
                <instance name="TWI" caption="Two Wire Serial Interface">
                    <register-group name="TWI" name-in-module="TWI" offset="0x00" address-space="data" caption="Two Wire Serial Interface"/>
                    <signals>
                        <signal group="SDA" function="default" pad="PD1"/>
                        <signal group="SCL" function="default" pad="PD0"/>
                    </signals>
                </instance>
            </module>
