bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64.xml
            <register-group caption="I/O Port" name="PORTF">
                <register caption="Data Register, Port F" name="PORTF" offset="0x62" size="1" mask="0xFF"/>
                <register caption="Data Direction Register, Port F" name="DDRF" offset="0x61" size="1" mask="0xFF"/>
                <register caption="Input Pins, Port F" name="PINF" offset="0x20" size="1" mask="0xFF" ocd-rw="R"/>
            </register-group>
            <register-group caption="I/O Port" name="PORTG">
                <register caption="Data Register, Port G" name="PORTG" offset="0x65" size="1" mask="0x1F"/>
                <register caption="Data Direction Register, Port G" name="DDRG" offset="0x64" size="1" mask="0x1F"/>
                <register caption="Input Pins, Port G" name="PING" offset="0x63" size="1" mask="0x1F" ocd-rw="R"/>
            </register-group>
        </module>
        <module caption="Timer/Counter, 8-bit Async" name="TC8_ASYNC">
            <register-group caption="Timer/Counter, 8-bit Async" name="TC0">
                <register caption="Timer/Counter Control Register" name="TCCR0" offset="0x53" size="1">
                    <bitfield caption="Force Output Compare" mask="0x80" name="FOC0"/>
                    <bitfield caption="Waveform Generation Mode 0" mask="0x40" name="WGM00" values="WAVEFORM_GEN_MODE"/>
                    <bitfield caption="Compare Match Output Modes" mask="0x30" name="COM0"/>
                    <bitfield caption="Waveform Generation Mode 1" mask="0x08" name="WGM01"/>
                    <bitfield caption="Clock Selects" mask="0x07" name="CS0" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter Register" name="TCNT0" offset="0x52" size="1" mask="0xFF"/>
                <register caption="Output Compare Register" name="OCR0" offset="0x51" size="1" mask="0xFF"/>
                <register caption="Asynchronus Status Register" name="ASSR" offset="0x50" size="1">
                    <bitfield caption="Asynchronus Timer/Counter 0" mask="0x08" name="AS0"/>
                    <bitfield caption="Timer/Counter0 Update Busy" mask="0x04" name="TCN0UB"/>
                    <bitfield caption="Output Compare register 0 Busy" mask="0x02" name="OCR0UB"/>
                    <bitfield caption="Timer/Counter Control Register 0 Update Busy" mask="0x01" name="TCR0UB"/>
                </register>
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x57" size="1">
                    <bitfield caption="Timer/Counter0 Output Compare Match Interrupt register" mask="0x02" name="OCIE0"/>
                    <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x56" size="1" ocd-rw="R">
                    <bitfield caption="Output Compare Flag 0" mask="0x02" name="OCF0"/>
                    <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
                </register>
                <register caption="Special Function IO Register" name="SFIOR" offset="0x40" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter0" mask="0x02" name="PSR0"/>
                </register>
            </register-group>
            <value-group caption="" name="WAVEFORM_GEN_MODE">
                <value caption="Normal" name="VAL_0x00" value="0x00"/>
                <value caption="PWM, Phase Correct" name="VAL_0x02" value="0x02"/>
                <value caption="CTC" name="VAL_0x01" value="0x01"/>
                <value caption="Fast PWM" name="VAL_0x03" value="0x03"/>
            </value-group>
            <value-group caption="" name="CLK_SEL_3BIT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/32" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/64" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/128" name="VAL_0x05" value="0x05"/>
                <value caption="Running, CLK/256" name="VAL_0x06" value="0x06"/>
                <value caption="Running, CLK/1024" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK" offset="0x57" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="TICIE1"/>
                    <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x10" name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x08" name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x04" name="TOIE1"/>
                </register>
                <register caption="Extended Timer/Counter Interrupt Mask Register" name="ETIMSK" offset="0x7D" size="1">
                    <bitfield caption="Timer/Counter 1, Output Compare Match C Interrupt Enable" mask="0x01" name="OCIE1C"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR" offset="0x56" size="1" ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x10" name="OCF1A"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x08" name="OCF1B"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x04" name="TOV1"/>
                </register>
                <register caption="Extended Timer/Counter Interrupt Flag register" name="ETIFR" offset="0x7C" size="1" ocd-rw="R">
                    <bitfield caption="Timer/Counter 1, Output Compare C Match Flag" mask="0x01" name="OCF1C"/>
                </register>
                <register caption="Special Function IO Register" name="SFIOR" offset="0x40" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset, T/C3, T/C2, T/C1" mask="0x01" name="PSR321"/>
                </register>
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x4F" size="1">
                    <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode 1B, bits" mask="0x30" name="COM1B"/>
                    <bitfield caption="Compare Output Mode 1C, bits" mask="0x0C" name="COM1C"/>
                    <bitfield caption="Waveform Generation Mode Bits" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x4E" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Clock Select1 bits" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x7A" size="1">
                    <bitfield caption="Force Output Compare for channel A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare for channel B" mask="0x40" name="FOC1B"/>
                    <bitfield caption="Force Output Compare for channel C" mask="0x20" name="FOC1C"/>
                </register>
                <register caption="Timer/Counter1 Bytes" name="TCNT1" offset="0x4C" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register Bytes" name="OCR1A" offset="0x4A" size="2" mask="0xFFFF"/>
